package game;

// ================================================================================================================== //
/** Класс GamePlayer. Определяет сущности игроков и их поведение.
 *  Уровень доступа:
 *      - доступность самого класса, конструктора и методов: доступно по всему проекту;
 *      - для основных переменных: доступно только внутри класса. */
public class GamePlayer {
// ================================================================================================================== //
    /* Блок основных переменных. */
    private char playerSign;
    private boolean realPlayer = true;
// ================================================================================================================== //
    /* Блок конструкторов класса. */
// ------------------------------------------------------------------------------------------------------------------ //
    /** Описание: Конструктор игрока.
     *  Входящие данные:
     *      @param isRealPlayer - признак типа игрока: `true` для человека и `false` для компьютера.
     *      @param playerSign - игровой знак игрока: `X` для человека и `O` для компьютера. */
    public GamePlayer(boolean isRealPlayer, char playerSign) {
        this.realPlayer = isRealPlayer;
        this.playerSign = playerSign;
    }
// ================================================================================================================== //
    /* Блок методов класса. */
// ------------------------------------------------------------------------------------------------------------------ //
    /** Описание: Метод, возвращающий признак типа игрока.
     *  Исходящие данные:
     *      @return boolean - признак типа игрока. */
    public boolean isRealPlayer() {
        return realPlayer;
    }
// ------------------------------------------------------------------------------------------------------------------ //
    /** Описание: Метод, возвращающий игровой знак игрока.
     *  Исходящие данные:
     *      @return boolean - игровой знак игрока. */
    public char getPlayerSign() {
        return playerSign;
    }
}
// ================================================================================================================== //
